# Core shell tools
brew "bat"
brew "direnv"
brew "mise"
brew "starship"
brew "zsh"

# Git
brew "diff-so-fancy"
brew "git"

# Terminal emulator
cask "ghostty"

# Editor
cask "antigravity"
cask "antigravity-ide"
cask "antigravity-cli"
cask "visual-studio-code"

# Development tools
brew "jq"
brew "tree"
cask "docker-desktop"

# Password manager
brew "bitwarden-cli"
cask "bitwarden"

# Misc
cask "istat-menus"
cask "zen"
cask "google-chrome"
cask "adguard"

# Zsh plugins
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts (for starship themes with nerd font icons)
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-menlo-for-powerline"
cask "font-lato"
cask "font-meslo-lg-nerd-font"
